/*跨表查询*/
/*select lid,title,content1,content2,content3,content4,content5,content6,content7,content8,introduce,names as n,poet_brief as b,poet_represent as r from ts_data,ts_poet where id_family=lid and title like '%早发%'*/
/*select lid,img_url,names,title from ts_poet,ts_data where id_family=lid*/


/****设置客户端连接使用的编码****/
SET NAMES UTF8;
/****丢弃数据库ts，如果存在****/
DROP DATABASE IF EXISTS ts;
/****创建数据库，存储的编码****/
CREATE DATABASE ts CHARSET=UTF8;
/****进入该数据库****/
USE ts;
/****创建用户数据表****/
CREATE TABLE ts_user(
  id    INT PRIMARY KEY AUTO_INCREMENT,
  uname  VARCHAR(50) COMMENT "名字",
  openid   VARCHAR(50) COMMENT "openid",
  uimg VARCHAR(128) NOT NULL COMMENT "用户图片",
  utime  datetime
);

/**** 轮播 ****/
CREATE TABLE ts_carousel(
  id      INT PRIMARY KEY AUTO_INCREMENT,
  pic     VARCHAR(128) COMMENT "图片"
);

/****创建诗人表****/
CREATE TABLE ts_poet(
  lid    INT PRIMARY KEY AUTO_INCREMENT,
  names  VARCHAR(16) COMMENT "诗人名字",
  name   VARCHAR(16) COMMENT "名字",
  img_url  VARCHAR(128) COMMENT "诗人图片",
  poet_brief  VARCHAR(256) COMMENT "诗人简介",
  poet_represent  VARCHAR(256) COMMENT "诗人代表作"
);

/****创建数据表****/
CREATE TABLE ts_data(
  did   INT PRIMARY KEY  AUTO_INCREMENT,
  id_family  INT COMMENT "所属诗人id",
  title  VARCHAR(32) COMMENT "唐诗名",
  content1  VARCHAR(32) COMMENT "第一句",
  content2  VARCHAR(32) COMMENT "第二句",
  content3  VARCHAR(32) COMMENT "第三句",
  content4  VARCHAR(32) COMMENT "第四句",
  content5  VARCHAR(32) COMMENT "第五句",
  content6  VARCHAR(32) COMMENT "第六句",
  content7  VARCHAR(32) COMMENT "第七句",
  content8  VARCHAR(32) COMMENT "第八句",
  introduce  VARCHAR(256) COMMENT "唐诗翻译"
);

/**** 创建儿歌音频表 ****/
CREATE TABLE nursery_rhyme(
  nid      INT PRIMARY KEY AUTO_INCREMENT,
  title    VARCHAR(32) COMMENT "儿歌名字",
  src      VARCHAR(128) COMMENT "儿歌音频",
  img_url  VARCHAR(128) COMMENT "音频图片"
);

/**** 创建故事音频表 ****/
CREATE TABLE story(
  nid      INT PRIMARY KEY AUTO_INCREMENT,
  title    VARCHAR(64) COMMENT "故事名字",
  src      VARCHAR(128) COMMENT "故事音频",
  img_url  VARCHAR(128) COMMENT "故事图片"
);

/**** 创建诗词音频表 ****/
CREATE TABLE poem(
  nid      INT PRIMARY KEY AUTO_INCREMENT,
  title    VARCHAR(32) COMMENT "诗词名字",
  name     VARCHAR(16) COMMENT "诗词作者",
  src      VARCHAR(128) COMMENT "诗词音频",
  img_url  VARCHAR(128) COMMENT "诗词图片"
);




/****************/
/****数据导入****/
/***************/
/**** 儿歌音频 ****/
INSERT INTO nursery_rhyme VALUES
  (NULL, '爱我你就抱抱我', 'aiwonijiubaobaowo.mp3', 'aiwonijiubaobaowo.jpg'),
  (NULL, '六只小鸭', 'liuzhixiaoya.mp3', 'liuzhixiaoya.jpg'),
  (NULL, '我的小猪', 'wodexiaozhu.mp3', 'wodexiaozhu.jpg'),
  (NULL, '拔萝卜', 'baluobo.mp3', 'baluobo.jpg'),
  (NULL, '爸爸去哪儿', 'babaquna.mp3', 'babaquna.jpg'),
  (NULL, '白龙马', 'bailongma.mp3', 'bailongma.jpg'),
  (NULL, '二十四节气歌', 'ershisijieqi.mp3', 'ershisijieqi.jpg'),
  (NULL, '布谷鸟', 'buguniao.mp3', 'buguniao.jpg'),
  (NULL, '拍手歌', 'paishouge.mp3', 'paishouge.jpg'),
  (NULL, '采蘑菇的小姑娘', 'caimogudexiaoguniang.mp3', 'caimogudexiaoguniang.jpg'),
  (NULL, '猪猪侠', 'zhuzhuxia.mp3', 'zhuzhuxia.jpg'),
  (NULL, '春天在哪里', 'chuntianzainali.mp3', 'chuntianzainali.jpg'),
  (NULL, '爸爸妈妈听我说', 'babamamatingwoshuo.mp3', 'babamamatingwoshuo.jpg'),
  (NULL, '唱首歌', 'changshouge.mp3', ''),
  (NULL, '冬天来了', 'dongtianlaile.mp3', 'dongtianlaile.jpg'),
  (NULL, '好妈妈', 'haomama.mp3', 'haomama.jpg'),
  (NULL, '老师同学', 'laoshitongxue.mp3', 'laoshitongxue.jpg'),
  (NULL, '衣服鞋帽名', 'yifuxiemaoming.mp3', 'yifuxiemaoming.jpg'),
  (NULL, '包饺子', 'baojiaozi.mp3', 'baojiaozi.jpg'),
  (NULL, '毕业歌', 'biyege.mp3', ''),
  (NULL, '快乐的一天开始了', 'kuailedeyitiankaishile.mp3', 'kuailedeyitiankaishile.jpg'),
  (NULL, '鲁冰花', 'lubinghua.mp3', 'lubinghua.jpg'),
  (NULL, '拍拍手碰碰脚', 'paishoupengjiao.mp3', 'paishoupengjiao.jpg'),
  (NULL, '散场律动口香糖', 'kouxiangtang.mp3', ''),
  (NULL, '数鸭歌', 'shuyage.mp3', 'shuyage.jpg'),
  (NULL, '孙悟空打妖怪', 'wukong.mp3', 'wukong.jpg'),
  (NULL, '太阳咪咪笑(体操版)', 'taiyang.mp3', 'taiyang.gif'),
  (NULL, '唐诗联唱', 'tangshilianchang.mp3', 'tangshilianchang.jpg'),
  (NULL, '兔子舞', 'tuziwu.mp3', 'tuziwu.jpg'),
  (NULL, '我的好妈妈', 'wodehaomama.mp3', 'wodehaomama.jpg'),
  (NULL, '我们大家做的好', 'womendajiazuodehao.mp3', 'womendajiazuodehao.jpg'),
  (NULL, '小猪吃的饱饱', 'xiaozhuchidebaobao.mp3', 'xiaozhuchidebaobao.jpg'),
  (NULL, '爷爷亲奶奶亲', 'yeyenainaiqin.mp3', 'yeyenainaiqin.jpg'),
  (NULL, '一只哈巴狗', 'yizhihabagou.mp3', 'yizhihabagou.jpg'),
  (NULL, '好爸爸坏爸爸', 'haobabahuaibaba.mp3', 'haobabahuaibaba.jpg'),
  (NULL, '黑猫警长', 'heimaojingzhang.mp3', 'heimaojingzhang.jpg'),
  (NULL, '一闪一闪亮晶晶', 'yishanyishan.mp3', 'yishanyishan.jpg'),
  (NULL, 'Three Sick Kittens', 'ThreeSickKittens.mp3', 'batamu.jpg', 133),
  (NULL, 'Three Little Kittens', 'ThreeLittleKittens.mp3', 'batamu1.jpg', 148),
  (NULL, 'Sing the Alphabet', 'SingtheAlphabet.mp3', 'batamu2.jpg', 151),
  (NULL, 'This Little Piggy', 'ThisLittlePiggy.mp3', 'batamu3.jpg', 106),
  (NULL, 'Rise and Shine', 'RiseandShine.mp3', 'batamu4.jpg', 109),
  (NULL, 'Rain Rain Go Away', 'RainRainGoAway.mp3', 'batamu5.jpg', 126);
INSERT INTO nursery_rhyme VALUES
  (NULL, 'Rise and Shine', 'RiseandShine.mp3', 'batamu4.jpg', 109, 1),
  

/**** 故事音频 ****/
INSERT INTO story VALUES
  (NULL, '斑马身上的花纹有什么用', 'banma.mp3', 'banma.jpg'),
  (NULL, '袋鼠为什么有袋', 'daishu.mp3', 'daishu.jpg'),
  (NULL, '狗为什么会拉雪橇', 'dog.mp3', 'dog.jpg'),
  (NULL, '猫为什么爱用爪子“洗脸”', 'mao.mp3', 'mao.jpg'),
  (NULL, '蛇为什么喜欢在春天蜕皮', 'she.mp3', 'she.jpg'),
  (NULL, '为什么北极熊不怕冷', 'beijixiong.mp3', 'beijixiong.jpg'),
  (NULL, '为什么壁虎的尾巴容易断', 'bihu.mp3', 'bihu.jpg'),
  (NULL, '为什么长颈鹿的脖子特别长', 'changjinglu.mp3', 'changjinglu.jpg'),
  (NULL, '为什么大熊猫是国宝', 'daxiongmao.mp3', 'daxiongmao.jpg'),
  (NULL, '为什么金丝猴一年要搬两次家', 'jinshihou.mp3', 'jinshihou.jpg'),
  (NULL, '为什么蚂蚁要爬到喜鹊的身上', 'mayi.mp3', 'mayi.jpg'),
  (NULL, '为什么马的耳朵时常摇动', 'ma.mp3', 'ma.jpg'),
  (NULL, '为什么马戏团的小狗能算算术', 'xiaogou.mp3', 'xiaogou.jpg'),
  (NULL, '为什么马要站着睡觉', 'ma1.mp3', 'ma.jpg'),
  (NULL, '为什么猫的眼睛一日三变', 'mao1.mp3', 'mao.jpg'),
  (NULL, '为什么梅花鹿身上的梅花会变', 'meihualu.mp3', 'meihualu.jpg', 151),
  (NULL, '为什么牛吃完草后还不停地咀嚼', 'niu.mp3', 'niu.jpg', 88),
  (NULL, '为什么说猩猩最聪明', 'xingxing.mp3', 'xingxing.jpg', 155),
  (NULL, '为什么小狗睡觉时要将耳朵贴在地上', 'xiaogou1.mp3', 'xiaogou.jpg', 81),
  (NULL, '为什么小熊猫总长不大', 'xiaoxingmao-001.mp3', 'xiaoxiongmao-001.jpeg', 165),
  (NULL, '为什么有时候蜻蜓飞的很低', 'qingting-002.mp3', 'qingting-002.jpg', 65),
  (NULL, '为什么在黑暗中猫能捉到老鼠', 'maozhualaoshu-003.mp3', 'maozhualaoshu-003.jpg', 80),
  (NULL, '为什么在夏天狗总是伸着舌头喘气', 'xiaogou-004.mp3', 'xiaogou-004.jpg', 76),
  (NULL, '猪为什么用嘴巴拱泥土', 'xiaozhu-005.mp3', 'xiaozhu-005.jpg', 92),
  (NULL, '蟋蟀的耳朵为什么长在脚上', 'xishuai-006.mp3', 'xishuai-006.jpg', 88),
  (NULL, '白白的雪', 'baibaidexue-007.mp3', 'baibaidexue-007.jpg', 72),
  (NULL, '猜猜我有多爱你', 'caicaiwoyouduoaini-008.mp3', 'aini-008.jpg', 124),
  (NULL, '吃什么', 'chishenme-009.mp3', 'chi-009.jpg', 56),
  (NULL, '打雷下雨我不怕', 'daleixiayu-010.mp3', 'daleixiayu-010.jpg', 39),
  (NULL, '点点爱上幼儿园', 'diandian-011.mp3', 'diandian-011.jpg', 99);
INSERT INTO story VALUES
  

/**** 诗词音频 ****/
INSERT INTO poem VALUES
  (NULL, '江雪', '柳宗元', 'jiangxue.mp3', 'jiangxue.jpg'),
  (NULL, '渔翁', '柳宗元', 'yuweng.mp3', 'yuweng.jpg'),
  (NULL, '与浩初上人同看山寄京华亲故', '柳宗元', 'kanshan.mp3', 'kanshan.jpg'),
  (NULL, '新沙', '陆龟蒙', 'xinsha.mp3', 'xinsha.jpg'),
  (NULL, '咏鹅', '骆宾王', 'yonge.mp3', 'yonge.jpg'),
  (NULL, '春晓', '孟浩然', 'chunxiao.mp3', 'chunxiao.jpg'),
  (NULL, '登鹳雀楼', '王之涣', 'dengguanquelou.mp3', 'dengguanquelou.jpg'),
  (NULL, '咏柳', '贺知章', 'yongliu.mp3', 'yongliu.jpg'),
  (NULL, '小儿垂钓', '胡令能', 'xiaoercuidiao.mp3', 'xiaoercuidiao.jpg'),
  (NULL, '春雪', '韩愈', 'chunxue.mp3', 'chunxue.jpg'),
  (NULL, '凉州词', '王之涣', 'liangzhouciw.mp3', 'liangzhouciw.jpg'),
  (NULL, '凉州词', '王翰', 'liangzhoucih.mp3', 'liangzhoucih.jpg'),
  (NULL, '公子行', '孟宾于', 'gongzixing.mp3', 'gongzixing.jpg'),
  (NULL, '游子吟', '孟郊', 'youziyin.mp3', 'youziyin.jpg'),
  (NULL, '题诗后', '贾岛', 'tishihou.mp3', 'tishihou.jpg'),
  (NULL, '蜂', '罗隐', 'feng-001.mp3', 'feng-001.jpg', 165),
  (NULL, '雪', '罗隐', 'xue-002.mp3', 'xue-002.jpg', 139),
  (NULL, '渡浙江问舟中人', '孟浩然', 'duzhejiang-003.mp3', 'duzhejiang-003.jpg', 168),
  (NULL, '于易水送人', '骆宾王', 'yuyisongren-004.mp3', 'yuyisongren-004.jpg', 122),
  (NULL, '宿石邑山中', '韩翃', 'sushiyishanzhong-005.mp3', 'sushiyishanzhong-005.jpg', 162),
  (NULL, '送朱大入秦', '孟浩然', 'songzhu-006.mp3', 'songzhu-006.jpg', 147),
  (NULL, '归雁', '钱起', 'guiyan-007.mp3', 'guiyan-007.jpg', 149),
  (NULL, '过野叟居', '马戴', 'guoye-008.mp3', 'shici-008.jpg', 195),
  (NULL, '宿建德江', '孟浩然', 'sujiandejiang-009.mp3', 'sujiandejiang-009.jpg', 139),
  (NULL, '洛桥晚望', '孟郊', 'luoqiao-010.mp3', 'luoqiao-010.jpg', 146),
  (NULL, '过故人庄', '孟浩然', 'guogurenzhuang-011.mp3', 'guogurenzhuang-011.jpg', 207),
  (NULL, '送杜少府之任蜀州', '王勃', 'songdushao-012.mp3', 'songdushao-012.jpg', 129),
  (NULL, '昌谷北园新笋', '李贺', 'changgu-013.mp3', 'changgu-013.jpg', 164),
  (NULL, '夜别韦司士', '高适', 'yebie-014.mp3', 'yebie-014.jpg', 233),
  (NULL, '寻隐者不遇', '贾岛', 'xunyin-015.mp3', 'xunyin-015.jpg', 136),
  (NULL, '晚春', '韩愈', 'wancun-016.mp3', 'wancun-016.jpg', 134),
  (NULL, '少年行', '令狐楚', 'shaonianxing-017.mp3', 'shaonianxing-017.jpg', 155);
INSERT INTO poem VALUES
  

/**** 轮播 ****/
INSERT INTO ts_carousel VALUES
  (NULL,"banner1.jpg"),
  (NULL,"banner2.jpg"),
  (NULL,"banner3.jpg");


/**** 用户数据 ****/




/****诗人数据****/
INSERT INTO ts_poet VALUES
  (NULL,"唐 - 李白","李白","lb1001.jpg","李白（701年－762年），别称：李十二、李翰林 、李供奉、李拾遗、诗仙。字太白，号青莲居士，又号“谪仙人”，是唐代伟大的浪漫主义诗人，被后人誉为“诗仙”，与杜甫并称为“李杜”，为了与另两位诗人李商隐与杜牧即“小李杜”区别，杜甫与李白又合称“大李杜”。其人爽朗大方，爱饮酒作诗，喜交友。","李白深受黄老列庄思想影响，有《李太白集》传世，诗作中多以醉时写的，代表作有《望庐山瀑布》、《行路难》、《蜀道难》、《将进酒》、《梁甫吟》、《早发白帝城》等多首。"),
  (NULL,"唐 - 杜甫","杜甫","df1001.jpg","杜甫（712年—770年），别称：杜少陵、杜工部、杜拾遗、杜草堂、老杜、诗圣。字子美，汉族，本襄阳人，后徙河南巩县。自号少陵野老，唐代伟大的现实主义诗人，与李白合称“李杜”。为了与另两位诗人李商隐与杜牧即“小李杜”区别，杜甫与李白又合称“大李杜”，杜甫也常被称为“老杜”。","杜甫创作了《春望》《北征》《三吏》《三别》等名作。乾元二年（759年）杜甫弃官入川，虽然躲避了战乱，生活相对安定，但仍然心系苍生，胸怀国事。虽然杜甫是个现实主义诗人，但他也有狂放不羁的一面，从其名作《饮中八仙歌》不难看出杜甫的豪气干云。"),
  (NULL,"唐 - 白居易","白居易","bjy1001.jpg","白居易（772年－846年），别称：诗王、诗魔。字乐天，号香山居士，又号醉吟先生，祖籍太原，到其曾祖父时迁居下邽，生于河南新郑。是唐代伟大的现实主义诗人，唐代三大诗人之一。白居易与元稹共同倡导新乐府运动，世称“元白”，与刘禹锡并称“刘白”。","白居易的诗歌题材广泛，形式多样，语言平易通俗，有“诗魔”和“诗王”之称。官至翰林学士、左赞善大夫。公元846年，白居易在洛阳逝世，葬于香山。有《白氏长庆集》传世，代表诗作有《长恨歌》、《卖炭翁》、《琵琶行》等。"),
  (NULL,"唐 - 杜牧","杜牧","dm1001.jpg","杜牧（803年－约852年），别称：杜牧之，后世称杜樊川。字牧之，号樊川居士，汉族，京兆万年（今陕西西安）人。杜牧是唐代杰出的诗人、散文家，是宰相杜佑之孙，杜从郁之子。唐文宗大和二年26岁中进士，授弘文馆校书郎。后赴江西观察使幕，转淮南节度使幕，又入观察使幕，理人国史馆修撰，膳部、比部、司勋员外郎，黄州、池州、睦州刺史等职。","因晚年居长安南樊川别墅，故后世称“杜樊川”，著有《樊川文集》。杜牧的诗歌以七言绝句著称，内容以咏史抒怀为主，其诗英发俊爽，多切经世之物，在晚唐成就颇高。杜牧人称“小杜”，以别于杜甫，“大杜”。与李商隐并称“小李杜”。"),
  (NULL,"唐 - 岑参","岑参","cs1001.jpg","岑参（约715-770年），别称：岑嘉州。唐代边塞诗人，南阳人，太宗时功臣岑文本重孙，后徙居江陵。岑参早岁孤贫，从兄就读，遍览史籍。唐玄宗天宝三载（744年）进士，初为率府兵曹参军。后两次从军边塞，先在安西节度使高仙芝幕府掌书记；天宝末年，封常清为安西北庭节度使时，为其幕府判官。代宗时，曾官嘉州刺史（今四川乐山），世称“岑嘉州”。大历五年（770年）卒于成都。","岑参工诗，长于七言歌行，代表作是《白雪歌送武判官归京》。现存诗三百六十首。对边塞风光，军旅生活，以及少数民族的文化风俗有亲切的感受，故其边塞诗尤多佳作。风格与高适相近，后人多并称“高岑”。有《岑参集》十卷，已佚。今有《岑嘉州集》七卷（或为八卷）行世。《全唐诗》编诗四卷。"),
  (NULL,"唐 - 韩翃","韩翃","hh1001.jpg","韩翃（约719年—788年），字君平，南阳（今河南南阳）人，唐代诗人。是“大历十才子”之一。天宝13年（754）考中进士，宝应年间在淄青节度使侯希逸幕府中任从事，后随侯希逸回朝，闲居长安十年。建中年间，因作一首《寒食》而被唐德宗所赏识，晋升不断，最终官至中书舍人。韩翃的诗笔法轻巧，写景别致，在当时传诵很广泛。","主要著作有《宿石邑山中》、《寒食》、《章台柳》等"),
  (NULL,"唐 - 张九龄","张九龄","zjl1001.jpg","张九龄（678年—740年），别称：子寿。字子寿，一名博物，谥文献。汉族，唐朝韶州曲江（今广东省韶关市）人，世称“张曲江”或“文献公”。唐朝开元年间名相，诗人。西汉留侯张良之后，西晋壮武郡公张华十四世孙。七岁知属文，唐中宗景龙初年进士，始调校书郎。玄宗即位，迁右补阙。唐玄宗开元时历官中书侍郎、同中书门下平章事、中书令。母丧夺哀，拜同平章事。是唐代有名的贤相；举止优雅，风度不凡。自张九龄去世后，唐玄宗对宰相推荐之士，总要问“风度得如九龄否？”因此，张九龄一直为后世人所崇敬、仰慕。","张九龄是一位有胆识、有远见的著名政治家、文学家、诗人、名相。他忠耿尽职，秉公守则，直言敢谏，选贤任能，不徇私枉法，不趋炎附势，敢与恶势力作斗争，为“开元之治”作出了积极贡献。他的五言古诗，诗风清淡，以素练质朴的语言，寄托深远的人生慨望，对扫除唐初所沿习的六朝绮靡诗风，贡献尤大。有《曲江集》。誉为“岭南第一人”。"),
  (NULL,"唐 - 王维","王维","ww1001.jpg","王维（701年－761年，一说699年—761年），别称：王右丞、诗佛。河东蒲州（今山西运城）人，祖籍山西祁县。唐朝著名诗人、画家，字摩诘，号摩诘居士。王维出身河东王氏，于开元十九年（731年）状元及第。历官右拾遗、监察御史、河西节度使判官。唐玄宗天宝年间，王维拜吏部郎中、给事中。安禄山攻陷长安时，王维被迫受伪职。长安收复后，被责授太子中允。唐肃宗乾元年间任尚书右丞，故世称“王右丞”。","王维参禅悟理，学庄信道，精通诗、书、画、音乐等，以诗名盛于开元、天宝间，尤长五言，多咏山水田园，与孟浩然合称“王孟”，有“诗佛”之称。书画特臻其妙，后人推其为南宗山水画之祖。苏轼评价其：“味摩诘之诗，诗中有画；观摩诘之画，画中有诗。”存诗400余首，代表诗作有《相思》、《山居秋暝》等。著作有《王右丞集》、《画学秘诀》。"),
  (NULL,"唐 - 孟浩然","孟浩然","mhr1001.jpg","孟浩然（689—740），别称：诗星、孟襄阳。名浩，字浩然，号孟山人，襄州襄阳（现湖北襄阳）人，世称孟襄阳。因他未曾入仕，又称之为孟山人，是唐代著名的山水田园派诗人。","孟浩然生当盛唐，早年有志用世，在仕途困顿、痛苦失望后，尚能自重，不媚俗世，修道归隐终身。曾隐居鹿门山。40岁时，游长安，应进士举不第。曾在太学赋诗，名动公卿，一座倾服，为之搁笔。开元二十五年（737）张九龄招致幕府，后隐居。孟诗绝大部分为五言短篇，多写山水田园和隐居的逸兴以及羁旅行役的心情。其中虽不无愤世嫉俗之词，而更多属于诗人的自我表现。孟浩然的诗在艺术上有独特的造诣，后人把孟浩然与盛唐另一山水诗人王维并称为“王孟”，主要著作有《孟浩然集》、《过故人庄》、《春晓》、《宿建德江》等");




/****唐诗数据****/
INSERT INTO ts_data VALUES
  (NULL,1,"早发白帝城","朝辞白帝彩云间，","千里江陵一日还。","两岸猿声啼不住，","轻舟已过万重山。","","","","","清晨，我告别高入云霄的白帝城；江陵远在千里，船行只一日时间。两岸猿声，还在耳边不停地啼叫；不知不觉，轻舟已穿过万重青山"),
  (NULL,8,"鹿柴","空山不见人，","但闻人语响。","返景入深林，","复照青苔上。","","","","","山中空空荡荡不见人影，只听得喧哗的人语声响。夕阳的金光射入深林中，青苔上映着昏黄的微光。"),
  (NULL,9,"早寒江上有怀","木落雁南度，","北风江上寒。","我家襄水上，","遥隔楚云端。","乡泪客中尽，","孤帆天际看。","迷津欲有问，","平海夕漫漫。","树叶飘落大雁飞向南方，北风萧瑟江上分外寒冷。我家在曲曲弯弯襄水边，远隔楚天云海迷迷茫茫。思乡的眼泪在旅途流尽，看归来的帆在天边徜徉。风烟迷离渡口可在何处，茫茫江水在夕阳下荡漾。"),
  (NULL,1,"送孟浩然之广陵","故人西辞黄鹤楼，","烟花三月下扬州。","孤帆远影碧空尽，","唯见长江天际流。","","","","","老朋友向我频频挥手，告别了黄鹤楼，在这柳絮如烟、繁花似锦的阳春三月去扬州远游。友人的孤船帆影渐渐地远去，消失在碧空的尽头，只看见一线长江，向邈远的天际奔流。"),
  (NULL,2,"登楼","花近高楼伤客心，","万方多难此登临。","锦江春色来天地，","玉垒浮云变古今。","北极朝廷终不改，","西山寇盗莫相侵。","可怜后主还祠庙，","日暮聊为梁甫吟。","繁花靠近高楼，远离家乡的我触目伤心，在这全国各地多灾多难的时刻，我登楼观览。锦江两岸蓬蓬勃勃的春色铺天盖地涌来，玉垒山上的浮云，古往今来，千形万象，变幻不定。朝廷如同北极星一样最终都不会改换，西山的寇盗吐蕃不要来侵扰。可叹蜀后主刘禅那样的昏君，仍然在祠庙中享受祭祀，黄昏的时候我也姑且吟诵那《梁甫吟》。"),
  (NULL,1,"静夜思","床前明月光，","疑是地上霜。","举头望明月，","低头思故乡。","","","","","明亮的月光洒在床前的窗户纸上，好像地上泛起了一层白霜。我禁不住抬起头来，看那天窗外空中的一轮明月，不由得低头沉思，想起远方的家乡。"),
  (NULL,8,"汉江临眺","楚塞三湘接，","荆门九派通。","江流天地外，","山色有无中。","郡邑浮前浦，","波澜动远空。","襄阳好风日，","留醉与山翁。","汉江流经楚塞又折入三湘，西起荆门往东与九江相通。远望江水好像流到天地外，近看山色缥缈若有若无中。岸边都城仿佛在水面浮动，水天相接波涛滚滚荡云空。襄阳的风光的确令人陶醉，我愿在此地酣饮陪伴山翁。"),
  (NULL,2,"登岳阳楼","昔闻洞庭水，","今上岳阳楼。","吴楚东南坼，","乾坤日夜浮。","亲朋无一字，","老病有孤舟。","戎马关山北，","凭轩涕泗流。","以前的日子就听说洞庭湖波澜壮阔，今日如愿终于登上岳阳楼。浩瀚的湖水把吴楚两地撕裂，似乎日月星辰都漂浮在水中。亲朋好友们音信全无，我年老多病，乘孤舟四处漂流。北方边关战事又起，我倚着栏杆远望泪流满面。"),
  (NULL,1,"怨情","美人卷珠帘，","深坐颦蛾眉。","但见泪痕湿，","不知心恨谁。","","","","","美人儿卷起珠帘等待等待，一直坐着把双眉紧紧锁闭。只看见她泪痕湿满了两腮，不知道她是恨人还是恨己。"),
  (NULL,4,"旅宿","旅馆无良伴，","凝情自悄然。","寒灯思旧事，","断雁警愁眠。","远梦归侵晓，","家书到隔年。","沧江好烟月，","门系钓鱼船。","住在旅馆中并无好的旅伴；忧郁的心情恰似凝固一般。对着寒灯回忆起故乡往事；就象失群的孤雁警醒愁眠。家乡太远归梦到破晓未成；家书寄到旅馆已时隔一年。我真羡慕门外沧江的烟月；渔人船只就系在自家门前。"),
  (NULL,1,"赠孟浩然","吾爱孟夫子，","风流天下闻。","红颜弃轩冕，","白首卧松云。","醉月频中圣，","迷花不事君。","高山安可仰，","徒此揖清芬。","我敬重孟浩然先生的庄重潇洒，他为人高尚风流倜傥闻名天下。少年时鄙视功名不爱官冕车马，高龄白首又归隐山林摒弃尘杂。明月夜常常饮酒醉得非凡高雅，他不事君王迷恋花草胸怀豁达。高山似的品格怎么能仰望着他？只在此揖敬他芬芳的道德光华！"),
  (NULL,8,"终南别业","中岁颇好道，","晚家南山陲。","兴来每独往，","胜事空自知。","行到水穷处，","坐看云起时。","偶然值林叟，","谈笑无还期。","中年以后存有较浓的好道之心，直到晚年才安家于终南山边陲。兴趣浓时常常独来独往去游玩，有快乐的事自我欣赏自我陶醉。间或走到水的尽头去寻求源流，间或坐看上升的云雾千变万化。偶然在林间遇见个把乡村父老，偶与他谈笑聊天每每忘了还家。"),
  (NULL,1,"春思","燕草如碧丝，","秦桑低绿枝。","当君怀归日，","是妾断肠时。","春风不相识，","何事入罗帏","","","燕塞春草，才嫩得象碧绿的小丝，秦地桑叶，早已茂密得压弯树枝。郎君啊，当你在边境想家的时候，正是我在家想你，肝肠断裂日子。多情的春风呵，我与你素不相识，你为何闯入罗帏，搅乱我的情思？"),
  (NULL,2,"蜀相","丞相祠堂何处寻，","锦官城外柏森森。","映阶碧草自春色，","隔叶黄鹂空好音。","三顾频烦天下计，","两朝开济老臣心。","出师未捷身先死，","长使英雄泪满襟。","何处去寻找武侯诸葛亮的祠堂？在成都城外那柏树茂密的地方。碧草照映台阶自当显露春色，树上的黄鹂隔枝空对婉转鸣唱。定夺天下先主曾三顾茅庐拜访，辅佐两朝开国与继业忠诚满腔。可惜出师伐魏未捷而病亡军中，常使历代英雄们对此涕泪满裳！"),
  (NULL,1,"金陵酒肆留别","风吹柳花满店香，","吴姬压酒唤客尝。","金陵子弟来相送，","欲行不行各尽觞。","请君试问东流水，","别意与之谁短长。","","","春风吹起柳絮，酒店满屋飘香，侍女捧出美酒，劝我细细品尝。金陵年轻朋友，纷纷赶来相送。欲走还留之间，各自畅饮悲欢。请你问问东流江水，别情与流水，哪个更为长远？"),
  (NULL,8,"积雨辋川庄作","积雨空林烟火迟，","蒸藜炊黍饷东菑。","漠漠水田飞白鹭，","阴阴夏木啭黄鹂。","山中习静观朝槿，","松下清斋折露葵。","野老与人争度罢，","海鸥何事更相疑。","空林积雨，薪火难以点燃。午饭做完，马上送向田间。漠漠水田，飞起几只白鹭；阴阴夏树，传来婉转鸟鸣。惯于山间安静，早起遍地看花。松下长吃素食，采摘路葵佐餐。我与野老已融洽无间，海鸥为何还要猜疑？"),
  (NULL,1,"送友人","青山横北郭，","白水绕东城。","此地一为别，","孤蓬万里征。","浮云游子意，","落日故人情。","挥手自兹去，","萧萧班马鸣。","北城门外青山横亘，东城之外白水环绕。在此地一分别，你就要像孤蓬一样万里飘泊了。白云飘浮不定如游子心意，太阳缓缓落山像我依依不舍的感情。彼此挥手，从此别离；萧萧马鸣，不忍分别"),
  (NULL,1,"听蜀僧浚弹琴","蜀僧抱绿绮，","西下峨眉峰。","为我一挥手，","如听万壑松。","客心洗流水，","馀响入霜钟。","不觉碧山暮，","秋云暗几重。","四川僧人抱弹名琴绿绮，他是来自巴蜀的峨嵋峰。他为我挥手弹奏了名曲，好象听到万壑松涛雄风。高山流水音调一洗情怀，袅袅余音融入秋天霜钟。不知不觉青山已披暮色，秋去也似乎暗淡了几重！"),
  (NULL,1,"夜泊牛渚怀古","牛渚西江夜，","青天无片云。","登舟望秋月，","空忆谢将军。","余亦能高咏，","斯人不可闻。","明朝挂帆席，","枫叶落纷纷。","秋夜行舟停泊在西江牛渚山，蔚蓝的天空中没有一丝游云。 我登上小船仰望明朗的秋月，徒然地怀想起东晋谢尚将军。 我也能够吟哦袁宏的咏史，可惜没有那识贤的将军倾听。 明早我将挂起船帆离开牛渚，这里只有满天枫叶飘落纷纷。"),
  (NULL,8,"送梓州李使君","万壑树参天，","千山响杜鹃。","山中一夜雨，","树杪百重泉。","汉女输橦布，","巴人讼芋田。","文翁翻教授，","不敢倚先贤。","万壑古树高耸云天，千山深处杜鹃啼啭。山中春雨一夜未停，树丛梢头流淌百泉。汉女辛劳织布纳税，巴人地少诉讼争田。望你发扬文翁政绩，奋发有为不负先贤。"),
  (NULL,1,"子夜四时歌·夏歌","镜湖三百里，","菡萏发荷花。","五月西施采，","人看隘若耶。","回舟不待月，","归去越王家。","","","镜湖之大有三百余里，到处都开满了欲放的苛花。西施五月曾在此采莲，引得来观看的人挤满了若耶溪。西施回家不到一个月，便被选进了宫中。 "),
  (NULL,1,"子夜四时歌·秋歌","长安一片月，","万户捣衣声。","秋风吹不尽，","总是玉关情。","何日平胡虏，","良人罢远征。","","","月色如银的京城，表面上一片平静，但捣衣声中却蕴含着千家万户的痛苦；秋风不息，也寄托着对边关思念的深情。读来让人怦然心动。结句是闺妇的期待，也是征人的心声。"),
  (NULL,1,"子夜四时歌·冬歌","明朝驿使发，","一夜絮征袍。","素手抽针冷，","那堪把剪刀。","裁缝寄远道，","几日到临洮。","","","明天早上就要出发打仗了，连夜为丈夫缝制征袍。 白皙的手此时抽针都冻得僵硬，又怎么拿起那冷如冰的剪刀？ 裁缝给丈夫寄去征袍，再过多少天才能到临洮？ "),
  (NULL,2,"八阵图","功盖三分国，","名高八阵图。","江流石不转，","遗恨失吞吴。","","","","","三国鼎立，孔明的功勋最为卓著，他创制的八卦阵，更是名扬千古。任凭江流冲击，石头却依然如故，千年遗恨，在于刘备失策想吞吴。"),
  (NULL,2,"闻官军收河南河北","剑外忽传收蓟北，","初闻涕泪满衣裳。","却看妻子愁何在，","漫卷诗书喜欲狂。","白日放歌须纵酒，","青春作伴好还乡。","即从巴峡穿巫峡，","便下襄阳向洛阳。","在剑南忽然传说，收复蓟北的消息，初听到悲喜交集，涕泪沾满了衣裳。回头看看妻子儿女，忧愁不知去向？胡乱收卷诗书，我高光得快要发狂！白天我要开怀痛饮，放声纵情歌唱；明媚春光和我作伴，我好启程还乡。仿佛觉得，我已从巴峡穿过了巫峡；很快便到了襄阳，旋即又奔向洛阳。"),
  (NULL,2,"江南逢李龟年","岐王宅里寻常见，","崔九堂前几度闻。","正是江南好风景，","落花时节又逢君。","","","","","当年在岐王宅里，常常见到你的演出；在崔九堂前，也曾多次欣赏你的艺术。没有想到，在这风景一派大好的江南；正是落花时节，能巧遇你这位老相熟。"),
  (NULL,8,"辋川闲居赠裴秀才迪","寒山转苍翠，","秋水日潺湲。","倚杖柴门外，","临风听暮蝉。","渡头馀落日，","墟里上孤烟。","复值接舆醉，","狂歌五柳前。","寒山转变得格外郁郁苍苍，秋水日日舒缓地流向远方。我柱杖伫立在茅舍的门外，迎风细听着那暮蝉的吟唱。渡头那边太阳快要落山了，村子里的炊烟一缕缕飘?。又碰到裴迪这个接舆酒醉，在恰如陶潜的我面前讴狂。"),
  (NULL,2,"宿府","清秋幕府井梧寒，","独宿江城蜡炬残。","永夜角声悲自语，","中天月色好谁看。","风尘荏苒音书绝，","关塞萧条行路难。","已忍伶俜十年事，","强移栖息一枝安。","深秋时节，幕府井边梧桐疏寒；独宿江城，更深人静残烛暗淡。长夜里，号角声有如人的悲语；中天月色虽好，谁有心情仰看？乱中四处漂泊，亲朋音书皆断，关塞零落萧条，行路十分艰难。忍受困苦，我颠沛流离了十年；勉强栖息一枝，暂借幕府偷安。"),
  (NULL,2,"别房太尉墓","他乡复行役，","驻马别孤坟。","近泪无干土，","低空有断云。","对棋陪谢傅，","把剑觅徐君。","唯见林花落，","莺啼送客闻。","我东西漂泊，一再奔走他乡异土，今日歇脚阆州，来悼别你的孤坟。泪水沾湿了泥土，心情十分悲痛，精神恍惚，就象低空飘飞的断云。当年与你对棋，比你为晋朝谢安，而今在你墓前，象季札拜别徐君。不堪回首，眼前只见这林花错落，离去时，听得黄莺啼声凄怆难闻。"),
  (NULL,2,"春宿左省","花隐掖垣暮，","啾啾栖鸟过。","星临万户动，","月傍九霄多。","不寝听金钥，","因风想玉珂。","明朝有封事，","数问夜如何。","左偏殿矮墙遮隐花丛，日已将暮， 投宿的鸟儿，一群群鸣叫着飞过。 星临宫中，千门万户似乎在闪烁， 靠近天廷，所得的月光应该更多。 夜不敢寝，听到宫门开启的钥锁， 晚风飒飒，想起上朝马铃的音波。 明晨上朝，还有重要的大事要做， 心里不安，多次地探问夜漏几何？"),
  (NULL,2,"登高","风急天高猿啸哀，","渚清沙白鸟飞回。","无边落木萧萧下，","不尽长江滚滚来","万里悲秋常作客，","百年多病独登台。","艰难苦恨繁霜鬓，","潦倒新停浊酒杯。","风急天高猿猴啼叫显得十分悲哀，水清沙白的河洲上有鸟儿在盘旋。无边无际的树木萧萧地飘下落叶，望不到头的长江水滚滚奔腾而来。悲对秋景感慨万里漂泊常年为客，一生当中疾病缠身今日独上高台。历尽了艰难苦恨白发长满了双鬓，衰颓满心偏又暂停了浇愁的酒杯。"),
  (NULL,2,"奉济驿重送严公四韵","远送从此别，","青山空复情。","几时杯重把，","昨夜月同行。","列郡讴歌惜，","三朝出入荣。","江村独归处，","寂寞养残生。","远送你从这里就要分别了，青山空自惆怅，倍增离情。什么时候能够再举杯共饮，昨天夜里我们还在月色中同行。各郡的百姓都讴歌你，不忍心你离去，你在三朝为官，多么光荣。送走你我独自回到江村，寂寞地度过剩下的岁月。"),
  (NULL,2,"阁夜","岁暮阴阳催短景，","天涯霜雪霁寒宵。","五更鼓角声悲壮，","三峡星河影动摇。","野哭几家闻战伐，","夷歌数处起渔樵。","卧龙跃马终黄土，","人事音书漫寂寥。","冬天到了，白天的时间就越来越短；漫天的雪在这个寒冷的夜晚停住了。天未明时，当地的驻军已开始活动起来，号角声起伏悲壮；倒映在三峡水中的星影摇曳不定。战乱的消息传来，千家万户哭声响彻四野；渔人、樵夫们在好几个地方唱起了民歌。（像）诸葛亮和公孙述这样的历史人物，（无论是贤还是愚）都终归黄土；我眼前的这点寂寥（指郊游和亲人间的慰藉）又算得了什么呢。"),
  (NULL,8,"送元二使安西","渭城朝雨浥轻尘，","客舍青青柳色新。","劝君更尽一杯酒，","西出阳关无故人。","","","","","清晨的微雨湿润了渭城地面的灰尘，空气清新，旅舍更加青翠。真诚地奉劝我的朋友再干一杯美酒，向西出了阳关就难以遇到故旧亲人。"),
  (NULL,2,"客至","舍南舍北皆春水，","但见群鸥日日来。","花径不曾缘客扫，","蓬门今始为君开。","盘飧市远无兼味，","樽酒家贫只旧醅。","肯与邻翁相对饮，","隔篱呼取尽余杯。","草堂的南北涨满了春水，只见鸥群日日结队飞来。老夫不曾为客扫过花径，今天才为您扫，这柴门不曾为客开过，今天为您打开。离市太远盘中没好菜肴，家底太薄只有陈酒招待。若肯邀请隔壁的老翁一同对饮，隔着篱笆唤来喝尽余杯！"),
  (NULL,2,"望岳","岱宗夫如何，","齐鲁青未了。","造化钟神秀，","阴阳割昏晓。","荡胸生曾云，","决眦入归鸟。","会当凌绝顶，","一览众山小。","巍峨的泰山，到底如何雄伟?走出齐鲁，依然可见那青青的峰顶。神奇自然会聚了千种美景，山南山北分隔出清晨和黄昏。层层白云，荡涤胸中沟壑；翩翩归鸟，飞入赏景眼圈。定要登上泰山顶峰，俯瞰群山，豪情满怀。"),
  (NULL,1,"登金陵凤凰台","凤凰台上凤凰游，","凤去台空江自流。","吴宫花草埋幽径，","晋代衣冠成古丘。","三山半落青天外，","二水中分白鹭洲。","总为浮云能蔽日，","长安不见使人愁。","凤凰台上曾经有凤凰鸟来这里游憩，而今凤凰鸟已京飞走了，只留下这座空台，伴着江水，仍径自东流不停。当年华丽的吴王宫殿，及宫中的千花百草，如今都已埋没在荒凉幽僻的小径中，晋代的达官显贵们，就算曾经有过辉煌的功业，如今也长眠于古坟中，化为一抔黄土。我站在台上，看着远处的三山，依然耸立在青天之外，白鹭洲把秦淮河隔成两条水道。天上的浮云随风飘荡，有时把太阳遮住，使我看不见长安城，而不禁感到非常忧愁。"),
  (NULL,2,"野望","西山白雪三城戍，","南浦清江万里桥。","海内风尘诸弟隔，","天涯涕泪一身遥。","惟将迟暮供多病，","未有涓埃答圣朝。","跨马出郊时极目，","不堪人事日萧条。","西山白雪皑皑护卫三城重镇，南浦边清江水长横跨万里桥。四海之内战火不断兄弟失散，只身远在天涯不禁涕泪涟涟。迟暮之年只有一身疾病相伴，未有丝毫劳绩报答圣明朝廷。骑马来到郊外不住纵目远望，世事日益萧条令人悲伤怅惘。"),
  (NULL,3,"望月有感","时难年荒世业空，","弟兄羁旅各西东。","田园寥落干戈后，","骨肉流离道路中。","吊影分为千里雁，","辞根散作九秋蓬。","共看明月应垂泪，","一夜乡心五处同。","时势艰难兵荒马乱，家业空空；兄弟逃难旅居异地，各自西东。战乱以后处处寥落，田园荒芜；骨肉分离漂泊流浪，失散途中。离群孤雁相隔千里，形影相吊；同根兄弟随风飞散，恰似秋蓬。天涯海角共看明月，无不垂泪；今夜思乡你我同心，五地相同。"),
  (NULL,2,"月夜","今夜鄜州月，","闺中只独看。","遥怜小儿女，","未解忆长安。","香雾云鬟湿，","清辉玉臂寒。","何时倚虚幌，","双照泪痕干。","今夜鄜州月亮，一定同样清圆，遥想闺中妻子，只能独自观赏。可怜幼小的儿女，怎懂思念的心酸？蒙蒙雾气，或许沾湿了妻子的鬓发；冷冷月光，该是映寒了妻子的玉臂。何时才能团圆相见，倚靠薄帷共赏明月。那是一定月色依旧，就让月光默默照干我们的泪痕。"),
  (NULL,3,"问刘十九","绿蚁新醅酒，","红泥小火炉。","晚来天欲雪，","能饮一杯无！","","","","","酿好了淡绿的米酒，烧旺了小小的火炉。天色将晚雪意渐浓，能否一顾寒舍共饮一杯暖酒？"),
  (NULL,8,"酬张少府","晚年唯好静，","万事不关心。","自顾无长策，","空知返旧林。","松风吹解带，","山月照弹琴。","君问穷通理，","渔歌入浦深。","晚年只图个安静的环境，对世事件件都不太关心。自认没有高策可以报国，只好归隐到这幽静山林。松风吹拂我且宽衣解带，山月高照正好弄弦弹琴。君若问穷困通达的道理，请听水边深处渔歌声音！"),
  (NULL,3,"后宫词","泪湿罗巾梦不成，","夜深前殿按歌声。","红颜未老恩先断，","斜倚薰笼坐到明。","","","","","泪水湿透罗巾，好梦却难做成；深夜，前殿传来有节奏的歌声。红颜尚未衰减，恩宠却已断绝；她独倚着熏笼，一直坐待天明。"),
  (NULL,4,"赤壁","折戟沉沙铁未销，","自将磨洗认前朝。","东风不与周郎便，","铜雀春深锁二乔。","","","","","一支折断了的铁戟（古代兵器）沉没在水底的沙中还没有销蚀掉，经过自己又磨又洗发现这是当年赤壁之战的遗留之物。假如东风不给周瑜以方便，结局恐怕是曹操取胜，二乔被关进铜雀台了。"),
  (NULL,8,"山居秋暝","空山新雨后，","天气晚来秋。","明月松间照，","清泉石上流。","竹喧归浣女，","莲动下渔舟。","随意春芳歇，","王孙自可留。","一场新雨过后，青山特别清朗，秋天的傍晚，天气格外的凉爽。明月透过松林撒落斑驳的静影，清泉轻轻地在大石上叮咚流淌。竹林传出归家洗衣女的谈笑声，莲蓬移动了，渔舟正下水撒网。任凭春天的芳菲随时令消逝吧，游子在秋色中，自可留连徜徉。"),
  (NULL,1,"渡荆门送别","渡远荆门外，","来从楚国游。","山随平野尽，","江入大荒流。","月下飞天境，","云生结海楼。","仍怜故乡水，","万里送行舟。","自剑门之外的西蜀沿江东下，来到了楚国境内作一次旅游。崇山随着荒野出现渐渐逝尽，长江进入了莽原也缓缓而流。月影倒映江中象是飞来天镜，云层缔构城郭幻出海市蜃楼。我依然怜爱这来自故乡之水，行程万里继续漂送我的行舟。"),
  (NULL,4,"泊秦淮","烟笼寒水月笼沙，","夜泊秦淮近酒家。","商女不知亡国恨，","隔江犹唱后庭花。","","","","","烟雾弥漫秋水，月光笼罩白沙；小船夜泊秦淮，靠近岸边酒家。歌女为人作乐，那知亡国之恨？她们在岸那边，还唱着后庭花。"),
  (NULL,8,"秋夜曲","桂魄初生秋露微，","轻罗已薄未更衣。","银筝夜久殷勤弄，","心怯空房不忍归。","","","","","一轮秋月刚刚升起秋露初生，丝绸已嫌太薄了却懒得更衣。更深夜阑还在殷勤拨弄银筝，原来是怕空房寂寞不忍回归。"),
  (NULL,1,"子夜四时歌·春歌","秦地罗敷女，","采桑绿水边。","素手青条上，","红妆白日鲜。","蚕饥妾欲去，","五马莫留连。","","","秦地的女子罗敷,在绿水边采桑叶.雪白的手攀在青枝上,嫩红的面容在阳光下特别鲜亮.蚕宝宝饿了,我将要回去,围观的儿郎们,不要再流连于此了."),
  (NULL,4,"遣怀","落魄江湖载酒行，","楚腰纤细掌中轻。","十年一觉扬州梦，","赢得青楼薄幸名。","","","","","飘泊江湖生活潦倒，常常载酒而行。放浪形骸沉溺美色，欣赏细腰轻盈。十年扬州不堪回首，竟是一场春梦；留连青楼，只落得个薄情郎的声名。"),
  (NULL,8,"竹里馆","独坐幽篁里，","弹琴复长啸。","深林人不知，","明月来相照。","","","","","月夜，独坐幽静的竹林子里，间或弹弹琴，间或吹吹口哨。竹林里僻静幽深，无人知晓，却有明月陪伴，殷勤来相照。"),
  (NULL,4,"秋夕","红烛秋光冷画屏，","轻罗小扇扑流萤。","天阶夜色凉如水，","坐看牵牛织女星","","","","","在秋夜里烛光映照着画屏，手拿着小罗扇扑打萤火虫。夜色里的石阶清凉如冷水，静坐寝宫凝视牛郎织女星。"),
  (NULL,5,"逢入京使","故园东望路漫漫，","双袖龙钟泪不干。","马上相逢无纸笔，","凭君传语报平安。","","","","","东望家乡路程又远又长，热泪湿双袖还不断流淌。在马上与你相遇无纸笔，请告家人说我平安无恙。"),
  (NULL,2,"旅夜书怀","细草微风岸，","危樯独夜舟。","星垂平野阔，","月涌大江流。","名岂文章著，","官因老病休。","飘飘何所似，","天地一沙鸥。","微风吹拂着江岸的细草，那立着高高桅杆的小船在夜里孤独地停泊着。星星垂在天边，平野显得宽阔；月光随波涌动，大江滚滚东流。我难道是因为文章而著名，年老病多也应该休官了。自己到处漂泊像什么呢？就像天地间的一只孤零零的沙鸥。"),
  (NULL,5,"和贾舍人早朝","鸡鸣紫陌曙光寒，","莺啭皇州春色阑。","金阙晓钟开万户，","玉阶仙仗拥千官。","花迎剑佩星初落，","柳拂旌旗露未干。","独有凤凰池上客，","阳春一曲和皆难。","五更鸡鸣，京都路上曙光略带微寒；黄莺鸣啭，长安城里已是春意阑珊。望楼晓钟响过，宫殿千门都已打开；玉阶前仪仗林立，簇拥上朝的官员。启明星初落，花径迎来佩剑的侍卫；柳条轻拂着旌旗，一滴滴露珠未干。唯有凤池中书舍人贾至，写诗称赞；他的诗是曲阳春白雪，要和唱太难。"),
  (NULL,9,"临洞庭上张丞相","八月湖水平，","涵虚混太清。","气蒸云梦泽，","波撼岳阳城。","欲济无舟楫，","端居耻圣明。","坐观垂钓者，","徒有羡鱼情。","秋水胜涨，几乎与岸平，水天含混迷茫与天空浑然一体。云梦大泽水气蒸腾白白茫茫，波涛汹涌似乎把岳阳城撼动。我想渡水苦于找不到船与桨，圣明时代闲居委实羞愧难容。闲坐观看别人辛勤临河垂钓，可惜只能空怀一片羡鱼之情。"),
  (NULL,5,"寄左省杜拾遗","联步趋丹陛，","分曹限紫微。","晓随天仗入，","暮惹御香归。","白发悲花落，","青云羡鸟飞。","圣朝无阙事，","自觉谏书稀。","上朝时齐步同登红色台阶，分署办公又和你相隔紫微。早晨跟着天子的仪仗入朝，晚上身染御炉的香气回归。满头增白发悲叹春花凋落，遥望青云万里羡慕鸟高飞。圣明的朝代大概没有错事，规谏皇帝的奏章日见稀微。"),
  (NULL,6,"寒食","春城无处不飞花，","寒食东风御柳斜。","日暮汉宫传蜡烛，","轻烟散入五侯家。","","","","","春天，长安城处处飘飞着落花；寒食节，东风把御园柳枝?斜。黄昏时，宫中传出御赐的烛火，轻烟散入了，新封的王侯之家。"),
  (NULL,6,"酬程近秋夜即事见赠","长簟迎风早，","空城澹月华。","星河秋一雁，","砧杵夜千家。","节候看应晚，","心期卧亦赊。","向来吟秀句，","不觉已鸣鸦。","我早早地枕着竹席迎风纳凉，清虚的秋夜京城荡漾着月光。一行秋雁高高地掠过了星空，千家万户传来了捣衣的声响。看节候应该是到了更深夜阑，思念友人心灵相期睡觉也晚。刚刚反复吟诵你送我的佳句，不觉乌鸦呱呱啼叫天已渐亮。"),
  (NULL,6,"同题仙游观","仙台初见五城楼，","风物凄凄宿雨收。","山色遥连秦树晚，","砧声近报汉宫秋。","疏松影落空坛静，","细草香生小洞幽。","何用别寻方外去，","人间亦自有丹丘。","在仙台初见，迎候仙人的五城十二楼；正是风物凄凄，一夜滴答的秋雨才休。山色空?，和远处的秦地树丛相连接;近处传来捣衣声，报告汉宫已经深秋。稀疏的松影撒落神坛，更显道观清静；小草铃芳扑鼻，犹衬出山洞小径深幽。不用再到别处去寻找，世外仙境所在；人间也有神仙居住的地方，名曰丹丘。"),
  (NULL,7,"望月怀远","海上生明月，","天涯共此时。","情人怨遥夜，","竟夕起相思。","灭烛怜光满，","披衣觉露滋。","不堪盈手赠，","还寝梦佳期。","一轮皎洁的明月，从海上徐徐升起；和我一同仰望的，有远在天涯的伊。有情人天各一方，同怨长夜之难挨；孤身彻夜不成眠，辗转反侧起相思。灭烛欣赏明月呵，清光淡淡泻满地；起身披衣去闲散，忽觉露珠侵人肌。月光虽美难采撷，送它给远方亲人；不如还家睡觉，或可梦见相会佳期。"),
  (NULL,7,"感遇十二首·其一","兰叶春葳蕤，","桂华秋皎洁。","欣欣此生意，","自尔为佳节。","谁知林栖者，","闻风坐相悦。","草木有本心，","何求美人折！","春天里的幽兰翠叶纷披，秋天里的桂花皎洁清新。世间的草木勃勃的生机，自然顺应了美好的季节。谁想到山林隐逸的高人，闻到芬芳因而满怀喜悦。草木散发香气源于天性，怎么会求观赏者攀折呢！"),
  (NULL,8,"杂诗","君自故乡来，","应知故乡事。","来日绮窗前，","寒梅著花未？","","","","","您是刚从我们家乡来的，一定了解家乡的人情世态。请问您来的时候我家雕画花纹的窗户前，那一株腊梅花开了没有？"),
  (NULL,8,"九月九日忆山东兄弟","独在异乡为异客，","每逢佳节倍思亲。","遥知兄弟登高处，","遍插茱萸少一人。","","","","","独自远离家乡难免总有一点凄凉，每到重阳佳节倍加思念远方的亲人。远远想到兄弟们身佩茱萸登上高处，也会因为少我一人而生遗憾之情。"),
  (NULL,2,"天末怀李白","凉风起天末，","君子意如何。","鸿雁几时到，","江湖秋水多。","文章憎命达","魑魅喜人过。","应共冤魂语，","投诗赠汨罗。","凉风飕飕地从边刮起，你的心境怎样呢？令我惦念不已。我的书信不知何时你能收到？只恐江湖险恶，秋水多风浪。创作文最忌讳坦荡的命途，奸佞小人最希望好人犯错误。你与沉冤的屈子同命运，应投诗于汨罗江诉说冤屈与不平。"),
  (NULL,8,"送别","山中相送罢，","日暮掩柴扉。","春草年年绿，","王孙归不归。","","","","","在山中送走了你以后，夕阳西坠我关闭柴扉。春草明年再绿的时候，游子呵你能不能回归？"),
  (NULL,2,"春望","国破山河在，","城春草木深。","感时花溅泪，","恨别鸟惊心。","烽火连三月，","家书抵万金。","白头搔更短，","浑欲不胜簪。","长安沦陷国家破碎，只有山河依旧，春天来了城空人稀，草木茂密深沉。感伤国事面对繁花，难禁涕泪四溅，亲人离散鸟鸣惊心，反觉增加离恨。立春以来战火频连，已经蔓延三月，家在?州音讯难得，一信抵值万金。愁绪缠绕搔头思考，白发越搔越短，头发脱落既短又少，简直不能插簪。"),
  (NULL,8,"红豆","红豆生南国，","春来发几枝。","愿君多采撷，","此物最相思。","","","","","晶莹闪亮的红豆，产于岭南；春天来了，该长得叶茂枝繁。愿你多多采摘它，嵌饰佩带；这玩艺儿，最能把情思包涵！"),
  (NULL,8,"归嵩山作","清川带长薄，","车马去闲闲。","流水如有意，","暮禽相与还。","荒城临古渡，","落日满秋山。","迢递嵩高下，","归来且闭关。","清沏溪流两岸林木枝茂叶繁，我乘着车马安闲地归隐嵩山。流水有意与我同去永不回返，暮鸟有心跟我一起倦飞知还。荒凉的城郭紧挨着古老渡口，夕阳的余辉映着经秋的重山。远远地来到嵩山下安家落户，决心归隐谢绝来客把门闭关。"),
  (NULL,9,"清明日宴梅道士房","林卧愁春尽，","开轩览物华。","忽逢青鸟使，","邀入赤松家。","丹灶初开火，","仙桃正发花。","童颜若可驻，","何惜醉流霞！","高卧林下正愁着春光将尽，掀开帘幕观赏景物的光华。忽然遇见传递信件的使者，原是赤松子邀我访问他家。炼丹的金炉灶刚刚生起火，院苑中的仙桃也正好开花。如果仙人真可以保住童颜，何惜醉饮返老还童的流霞。"),
  (NULL,8,"过香积寺","不知香积寺，","数里入云峰。","古木无人径，","深山何处钟。","泉听咽危石，","日色冷青松。","薄暮空潭曲，","安禅制毒龙。","不知道香积寺在哪里，进山走了几里路见到山峰云雾缭绕。古木参天没有人走的路径，深山之中传来了寺庙的钟声。山泉流过高险的山石发出幽咽的声音，树木葱郁，连照到松树上的日光也有寒意。黄昏时，潭中应有毒龙，然而现在空无所有，可见高僧安禅可以制伏毒龙。"),
  (NULL,8,"和贾至舍人早朝大明宫之作","绛帻鸡人报晓筹，","尚衣方进翠云裘。","九天阊阖开宫殿，","万国衣冠拜冕琉。","日色才临仙掌动，","香烟欲傍衮龙浮。","朝罢须裁五色诏，","佩声归到凤池头。","戴着大红色头巾的宫廷报效卫士报过了五更，掌管皇上穿戴的官员才给皇上穿上龙袍。皇宫的门一扇扇打开，万方的官员进入宫中向皇帝朝拜。太阳刚刚升起，皇上的御驾就来临，御香炉的香烟漂浮在皇帝的身上。朝拜完毕回到宫属，为皇上拟写诏书，归去的路上身上的玉珮叮叮作响。"),
  (NULL,8,"终南山","太乙近天都，","连山到海隅。","白云回望合，","青霭入看无。","分野中峰变，","阴晴众壑殊。","欲投人处宿，","隔水问樵夫。","终南山接近京城长安，崇山峻岭相连一直到海边。四边观望，白云缭绕，聚合不散；远处青青的烟云，接近后又看不见了。地域的分野在主峰成为分界，向阳背阴的山峰山谷阴晴各不相同。想到有人居住的地方投宿，隔着流水询问砍柴的樵夫。"),
  (NULL,8,"酬郭给事","洞门高阁霭余辉，","桃李阴阴柳絮飞。","禁里疏钟官舍晚，","省中啼鸟吏人稀。","晨摇玉佩趋金殿，","夕奉天书拜琐闱。","强欲从君无那老，","将因卧病解朝衣。","门庭楼阁沐浴着夕阳的余晖，桃李繁荣茂盛柳絮乘风纷飞。禁宫中官舍的晚钟稀稀落落，门下省里鸟鸣吏少无事可为。凌晨身佩玉饰进诣銮殿朝拜，傍晚捧着诏书退朝拜别琐闱。我想随您进退无奈年迈体衰，将因常常卧病解脱朝衣引退。"),
  (NULL,9,"春晓","春眠不觉晓，","处处闻啼鸟。","夜来风雨声，","花落知多少。","","","","","春日里贪睡不知不觉天已破晓，搅乱我酣眠的是那啁啾的小鸟。昨天夜里风声雨声一直不断，那娇美的春花不知被吹落了多少？"),
  (NULL,9,"宿建德江","移舟泊烟渚，","日暮客愁新。","野旷天低树，","江清月近人。","","","","","我把船停泊在暮烟笼罩的小洲，茫茫暮色给游子新添几分乡愁。旷野无垠远处天空比树木还低，江水清澈更觉月与人意合情投……"),
  (NULL,9,"与诸子登岘山","人事有代谢，","往来成古今。","江山留胜迹，","我辈复登临。","水落鱼梁浅，","天寒梦泽深。","羊公碑尚在，","读罢泪沾襟。","人间的事情都有更替变化，来来往往的时日形成古今。江山各处保留的名胜古迹，而今我们又可以登攀亲临。鱼梁洲因水落而露出江面，云梦泽由天寒而迷濛幽深。羊祜碑如今依然巍峨矗立，读罢碑文泪水沾湿了衣襟。"),
  (NULL,9,"过故人庄","故人具鸡黍，","邀我至田家。","绿树村边合，","青山郭外斜。","开轩面场圃，","把酒话桑麻。","待到重阳日，","还来就菊花。","老友备好了黄米饭和烧鸡，邀我做客到他朴实的田家。村子外边是一圈绿树环抱，郊外是苍翠的小山包平斜。推开窗户迎面是田地场圃，把酒对饮闲聊着耕作桑麻。等到九月重阳节的那一天，再一次来品尝菊花酒好啦！"),
  (NULL,8,"送别","下马饮君酒，","问君何所之。","君言不得意，","归卧南山陲。","但去莫复问，","白云无尽时。","","","请你下马喝一杯美酒，我想问问你要去哪里？你说官场生活不得志，想要归隐南山的边陲。你只管去吧我不再问，白云无穷尽足以自娱。"),
  (NULL,9,"留别王维","寂寂竟何待，","朝朝空自归。","欲寻芳草去，","惜与故人违。","当路谁相假，","知音世所稀。","只应守寂寞，","还掩故园扉。","这样寂寞无聊还有什么可待？天天碌碌无为独自空手而归。我想归隐山林去寻芳馨花卉，但又珍惜友情不愿分手相违。如今当权者们谁肯提携我辈，世上要寻知音实在寥寥无几。或许今生今世命合空守寂寞，还是回家关闭我的故园门扉。"),
  (NULL,4,"将赴吴兴登乐游原","清时有味是无能，","闲爱孤云静爱僧。","欲把一麾江海去，","乐游原上望昭陵。","","","","","太平时有闲情逸兴，是无能之人；喜欢孤云悠闲，也喜欢和尚清静。我想手擎旌麾，远去江海的吴兴；再登上乐游原，遥望太宗的昭陵。"),
  (NULL,9,"宿桐庐江寄广陵旧游","山暝听猿愁，","沧江急夜流。","风鸣两岸叶，","月照一孤舟。","建德非吾土，","维扬忆旧游。","还将两行泪，","遥寄海西头。","山色昏暗听到猿声使人生愁，桐江苍茫夜以继日向东奔流。两岸风吹树动枝叶沙沙作响，月光如水映照江畔一叶孤舟。建德风光虽好却非我的故土，我仍然怀念扬州的故交老友。相忆相思我抑不住涕泪两行，遥望海西头把愁思寄去扬州。"),
  (NULL,2,"月夜忆舍弟","戍鼓断人行，","秋边一雁声。","露从今夜白，","月是故乡明。","有弟皆分散，","无家问死生。","寄书长不避，","况乃未休兵。","戍楼上的更鼓声隔断了人们的来往，边塞的秋天里，一只孤雁正在鸣叫。从今夜就进入了白露节气，月亮还是故乡的最明亮。有兄弟却都分散了，没有家无法探问生死。寄往洛阳城的家书常常不能送到，何况战乱频繁没有停止。"),
  (NULL,3,"赋得古原草送别","离离原上草，","一岁一枯荣。","野火烧不尽，","春风吹又生。","远芳侵古道，","晴翠接荒城。","又送王孙去，","萋萋满别情。","长长的原上草是多么茂盛，每年秋冬枯黄春来草色浓。无情的野火只能烧掉干叶，春风吹来大地又是绿茸茸。野草野花蔓延着淹没古道，艳阳下草地尽头是你征程。我又一次送走知心的好友，茂密的青草代表我的深情。"),
  (NULL,9,"岁暮归南山","北阙休上书，","南山归敝庐。","不才明主弃，","多病故人疏。","白发催年老，","青阳逼岁除。","永怀愁不寐，","松月夜窗虚。","不要再给北面朝廷上书，让我回到南山破旧茅屋。我本无才难怪明主见弃，年迈多病朋友也都生疏。白发频生催人日渐衰老，阳春来到逼得旧岁逝去。满怀忧愁辗转难以入睡，月照松林窗外一片空虚。"),
  (NULL,4,"金谷园","繁华事散逐香尘，","流水无情草自春。","日暮东风怨啼鸟，","落花犹似坠楼人。","","","","","繁华往事，已跟香尘一样飘荡无存；流水无情，野草却年年以碧绿迎春。啼鸟悲鸣，傍晚随着东风声声传来；落花纷纷，恰似那为石崇坠楼的绿珠美人。"),
  (NULL,1,"玉阶怨","玉阶生白露，","夜久侵罗袜。","却下水晶帘，","玲珑望秋月。","","","","","玉砌的台阶已滋生了白露，夜深伫立露水侵湿了罗袜。我只好入室垂下水晶帘子，独自隔帘仰望玲珑的秋月。"),
  (NULL,4,"寄扬州韩绰判官","青山隐隐水迢迢，","秋尽江南草未凋。","二十四桥明月夜，","玉人何处教吹箫。","","","","","青山隐隐起伏，江流千里迢迢。时令已过深秋，江南草木枯凋。扬州二十四桥，月色格外娇娆。老友你在何处，听取美人吹箫？"),
  (NULL,9,"秦中感秋寄远上人","一丘尝欲卧，","三径苦无资。","北土非吾愿，","东林怀我师。","黄金燃桂尽，","壮志逐年衰。","日夕凉风至，","闻蝉但益悲。","我常常愿隐居小丘醉卧林泉，想回到旧的家园又苦于无钱。久住北方求仕并非我的心愿，我怀念的是东林寺高僧名远。长安米珠薪桂生活如同销金，壮志逐年衰退事业与我无缘。日色已晚阵阵凉风轻轻拂面，听到秋蝉吟唱心中更加悲怨。");

/**** 音频数据 ****/




